InformationRegisters/УчетПоСтратегииАкций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УчетПоСтратегииАкций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КотировкиВРеальномВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КотировкиВРеальномВремени</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Уровни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Уровни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПокупки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АктивностьУровня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидУчетаПоСтратегии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидУчетаПоСтратегии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛотов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоговыйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Уровни</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСЗаявками/Ext/Module.bsl
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОбщийАлгоритмРаботыСЗаявками(МассивАкций) Экспорт
	
	Дата = ТекущаяДатаСеанса();
    ТаблицаАкцийВЗаявки = ПолучитьТаблицуАкцийЗаявок(МассивАкций,Дата);
	//Проверяем наличия документа заявка 
	
		

	//Когда будет выставленна заявка снять активность.

КонецПроцедуры 

// (Устарело)Функция проверяет элементы справочника Акции на наличие учета по стратегии в автоматическом режиме
//
// Параметры:
//  <Параметр1>МассивАкций  - Массив <Тип.Вид> - 
//
Функция ПроверкаУчетаПоСтратегииАвтоматически (МассивАкций) 
	МассивАкцийСоСтратегией = Новый Массив;
	Для Каждого Акция Из МассивАкций Цикл 
		Если Акция.УчетПоСтратегии = Истина И Акция.ВидУчетаПоСтратегии = Перечисления.ВидУчетаПоСтратегии.Автоматический Тогда
			МассивАкцийСоСтратегией.Добавить(Акция);	           
		КонецЕсли;
	КонецЦикла;
Возврат МассивАкцийСоСтратегией; 	
КонецФункции

Функция ПолучитьТаблицуАкцийЗаявок(МассивАкций, Дата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Акция", МассивАкций);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетПоСтратегииАкцийСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	               |	УчетПоСтратегииАкцийСрезПоследних.Акция КАК Акция,
	               |	УчетПоСтратегииАкцийСрезПоследних.Период КАК ДатаСтратегии,
	               |	УчетПоСтратегииАкцийСрезПоследних.ВестиУчет КАК ВестиУчет
	               |ПОМЕСТИТЬ ВТ_Стратегия
	               |ИЗ
	               |	РегистрСведений.УчетПоСтратегииАкций.СрезПоследних(&Дата, Акция В (&Акция)) КАК УчетПоСтратегииАкцийСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Стратегия.БрокерскийСчет КАК БрокерскийСчет,
	               |	ВТ_Стратегия.Акция КАК Акция,
	               |	ВТ_Стратегия.ДатаСтратегии КАК ДатаСтратегии,
	               |	ВТ_Стратегия.ВестиУчет КАК ВестиУчет,
	               |	КотировкиВРеальномВремениСрезПоследних.Период КАК ДатаКурса,
	               |	КотировкиВРеальномВремениСрезПоследних.Цена КАК ЦенаКурса
	               |ПОМЕСТИТЬ ВТ_Курс
	               |ИЗ
	               |	ВТ_Стратегия КАК ВТ_Стратегия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиВРеальномВремени.СрезПоследних КАК КотировкиВРеальномВремениСрезПоследних
	               |		ПО ВТ_Стратегия.Акция = КотировкиВРеальномВремениСрезПоследних.Акция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(УровниСрезПоследних.ЦенаПокупки) КАК ЦенаПокупки,
	               |	УровниСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	               |	УровниСрезПоследних.Акция КАК Акция
	               |ПОМЕСТИТЬ ВТ_ЦеныПокупки
	               |ИЗ
	               |	РегистрСведений.Уровни.СрезПоследних(
	               |			&Дата,
	               |			Акция В (&Акция)
	               |				И АктивностьУровня = ИСТИНА
	               |				И КоличествоПокупки > 0) КАК УровниСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УровниСрезПоследних.Акция,
	               |	УровниСрезПоследних.БрокерскийСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЦеныПокупки.БрокерскийСчет КАК БрокерскийСчет,
	               |	ВТ_ЦеныПокупки.Акция КАК Акция,
	               |	УровниСрезПоследних.Уровень КАК Уровень,
	               |	ВТ_ЦеныПокупки.ЦенаПокупки КАК ЦенаПокупки,
	               |	УровниСрезПоследних.КоличествоПокупки КАК КоличествоПокупки,
	               |	0 КАК ЦенаПродажи,
	               |	0 КАК КоличествоПродажи
	               |ПОМЕСТИТЬ ВТ_Покупки
	               |ИЗ
	               |	ВТ_ЦеныПокупки КАК ВТ_ЦеныПокупки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Уровни.СрезПоследних(
	               |				&Дата,
	               |				АктивностьУровня = ИСТИНА
	               |					И КоличествоПокупки > 0) КАК УровниСрезПоследних
	               |		ПО ВТ_ЦеныПокупки.БрокерскийСчет = УровниСрезПоследних.БрокерскийСчет
	               |			И ВТ_ЦеныПокупки.Акция = УровниСрезПоследних.Акция
	               |			И ВТ_ЦеныПокупки.ЦенаПокупки = УровниСрезПоследних.ЦенаПокупки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(УровниСрезПоследних.ЦенаПродажи) КАК ЦенаПродажи,
	               |	УровниСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	               |	УровниСрезПоследних.Акция КАК Акция
	               |ПОМЕСТИТЬ ВТ_ЦеныПродажи
	               |ИЗ
	               |	РегистрСведений.Уровни.СрезПоследних(
	               |			&Дата,
	               |			Акция В (&Акция)
	               |				И АктивностьУровня = ИСТИНА
	               |				И КоличествоПродажи > 0) КАК УровниСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УровниСрезПоследних.Акция,
	               |	УровниСрезПоследних.БрокерскийСчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЦеныПродажи.БрокерскийСчет КАК БрокерскийСчет,
	               |	ВТ_ЦеныПродажи.Акция КАК Акция,
	               |	ВТ_ЦеныПродажи.ЦенаПродажи КАК ЦенаПродажи,
	               |	0 КАК ЦенаПокупки,
	               |	0 КАК КоличествоПокупки,
	               |	УровниСрезПоследних.КоличествоПродажи КАК КоличествоПродажи,
	               |	УровниСрезПоследних.Уровень КАК Уровень
	               |ПОМЕСТИТЬ ВТ_Продажи
	               |ИЗ
	               |	ВТ_ЦеныПродажи КАК ВТ_ЦеныПродажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Уровни.СрезПоследних(
	               |				&Дата,
	               |				Акция В (&Акция)
	               |					И АктивностьУровня = ИСТИНА
	               |					И КоличествоПродажи > 0) КАК УровниСрезПоследних
	               |		ПО ВТ_ЦеныПродажи.ЦенаПродажи = УровниСрезПоследних.ЦенаПродажи
	               |			И ВТ_ЦеныПродажи.БрокерскийСчет = УровниСрезПоследних.БрокерскийСчет
	               |			И ВТ_ЦеныПродажи.Акция = УровниСрезПоследних.Акция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Покупки.БрокерскийСчет КАК БрокерскийСчет,
	               |	ВТ_Покупки.Акция КАК Акция,
	               |	ВТ_Покупки.Уровень КАК Уровень,
	               |	ВТ_Покупки.ЦенаПродажи КАК ЦенаПродажи,
	               |	ВТ_Покупки.КоличествоПродажи КАК КоличествоПродажи,
	               |	ВТ_Покупки.ЦенаПокупки КАК ЦенаПокупки,
	               |	ВТ_Покупки.КоличествоПокупки КАК КоличествоПокупки
	               |ПОМЕСТИТЬ ВТ_ПокупкаПродажа
	               |ИЗ
	               |	ВТ_Покупки КАК ВТ_Покупки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Продажи.БрокерскийСчет,
	               |	ВТ_Продажи.Акция,
	               |	ВТ_Продажи.Уровень,
	               |	ВТ_Продажи.ЦенаПродажи,
	               |	ВТ_Продажи.КоличествоПродажи,
	               |	ВТ_Продажи.ЦенаПокупки,
	               |	ВТ_Продажи.КоличествоПокупки
	               |ИЗ
	               |	ВТ_Продажи КАК ВТ_Продажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Курс.БрокерскийСчет КАК БрокерскийСчет,
	               |	ВТ_Курс.Акция КАК Акция,
	               |	ВТ_Курс.ДатаСтратегии КАК ДатаСтратегии,
	               |	ВТ_Курс.ВестиУчет КАК ВестиУчет,
	               |	ВТ_Курс.ДатаКурса КАК ДатаКурса,
	               |	ВТ_Курс.ЦенаКурса КАК ЦенаКурса,
	               |	ВТ_ПокупкаПродажа.Уровень КАК Уровень,
	               |	ВТ_ПокупкаПродажа.ЦенаПокупки КАК ЦенаПокупки,
	               |	ВТ_ПокупкаПродажа.КоличествоПокупки КАК КоличествоПокупки,
	               |	ВТ_ПокупкаПродажа.ЦенаПродажи КАК ЦенаПродажи,
	               |	ВТ_ПокупкаПродажа.КоличествоПродажи КАК КоличествоПродажи
	               |ИЗ
	               |	ВТ_Курс КАК ВТ_Курс
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ПокупкаПродажа КАК ВТ_ПокупкаПродажа
	               |		ПО ВТ_Курс.БрокерскийСчет = ВТ_ПокупкаПродажа.БрокерскийСчет
	               |			И ВТ_Курс.Акция = ВТ_ПокупкаПродажа.Акция";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	ТаблицаАкцийДанных = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаАкцийДанных; 

	

КонецФункции // ПолучитьТаблицуАкцийЗаявок()

Функция ПолучитьТекущиеЦеныИзРегистра(ТаблицаАкцийСУчетомПоСтратегии,Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗАкция",ТаблицаАкцийСУчетомПоСтратегии);
	Запрос.УстановитьПараметр("Дата",Дата); 
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	ТЗАкция.Акция КАК Акция,
	               	|	ТЗАкция.БрокерскийСчет КАК БрокерскийСчет,
	               	|	ТЗАкция.ДатаНачалаУчетаПоСтратегии КАК ДатаНачалаУчетаПоСтратегии,
	               	|	ТЗАкция.ВестиУчет КАК ВестиУчет
	               	|ПОМЕСТИТЬ ВТ_Акции
	               	|ИЗ
	               	|	&ТЗАкция КАК ТЗАкция
	               	|;
	               	|
	               	|////////////////////////////////////////////////////////////////////////////////
	               	|ВЫБРАТЬ
	               	|	ВТ_Акции.БрокерскийСчет КАК БрокерскийСчет,
	               	|	ВТ_Акции.Акция КАК Акция,
	               	|	ВТ_Акции.ДатаНачалаУчетаПоСтратегии КАК ДатаНачалаУчетаПоСтратегии,
	               	|	ВТ_Акции.ВестиУчет КАК ВестиУчет,
	               	|	КотировкиВРеальномВремениСрезПоследних.Период КАК Период,
	               	|	КотировкиВРеальномВремениСрезПоследних.Цена КАК Цена
	               	|ИЗ
	               	|	ВТ_Акции КАК ВТ_Акции
	               	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиВРеальномВремени.СрезПоследних(&Дата, ) КАК КотировкиВРеальномВремениСрезПоследних
	               	|		ПО ВТ_Акции.Акция = КотировкиВРеальномВремениСрезПоследних.Акция";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	ТаблицаАкцийСТекущимКурсом = РезультатЗапроса.Выгрузить();
	Возврат ТаблицаАкцийСТекущимКурсом; 
КонецФункции 

Функция ПоулчитьУровеньПокупкиПродажи(ТЗАкция)
Запрос = Новый Запрос;
Запрос.УстановитьПараметр("ТЗАкция",ТЗАкция); 
Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
               |	УровниСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
               |	УровниСрезПоследних.Акция КАК Акция,
               |	УровниСрезПоследних.Уровень КАК Уровень,
               |	УровниСрезПоследних.ЦенаПокупки КАК ЦенаПокупки,
               |	УровниСрезПоследних.КоличествоПокупки КАК КоличествоПокупки,
               |	ТЗАкции.Акция КАК Акция2,
               |	ТЗАкции.ЦенаЦена КАК ЦенаЦена,
               |	ТЗАкции.ДатаТекКурса КАК ДатаТекКурса
               |ИЗ
               |	&ТЗАкции КАК ТЗАкции
               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Уровни.СрезПоследних(, ) КАК УровниСрезПоследних
               |		ПО ТЗАкции.Акция = УровниСрезПоследних.Акция
               |ГДЕ
               |	УровниСрезПоследних.КоличествоПокупки > 0
               |	И УровниСрезПоследних.АктивностьУровня = ИСТИНА
               |
               |СГРУППИРОВАТЬ ПО
               |	УровниСрезПоследних.БрокерскийСчет,
               |	УровниСрезПоследних.Акция,
               |	УровниСрезПоследних.Уровень,
               |	УровниСрезПоследних.КоличествоПокупки,
               |	УровниСрезПоследних.ЦенаПокупки,
               |	ТЗАкции.Акция,
               |	ТЗАкции.ЦенаЦена,
               |	ТЗАкции.ДатаТекКурса
               |
               |УПОРЯДОЧИТЬ ПО
               |	ЦенаПокупки УБЫВ";	
Запрос.УстановитьПараметр("Акция",ТЗАкция.Акция); 
Запрос.УстановитьПараметр("Период",ТЗАкция.Период);
РезультатЗапроса = Запрос.Выполнить();
Если РезультатЗапроса.Пустой() Тогда
	Возврат Ложь;
КонецЕсли;	
	
	
КонецФункции

Функция ПолучитьУровеньПокупки (ТЗАкция)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	УровниСрезПоследних.БрокерскийСчет КАК БрокерскийСчет,
	|	УровниСрезПоследних.Акция КАК Акция,
	|	УровниСрезПоследних.Уровень КАК Уровень,
	|	УровниСрезПоследних.ЦенаПокупки КАК ЦенаПокупки,
	|	УровниСрезПоследних.КоличествоПокупки КАК КоличествоПокупки
	|ИЗ
	|	РегистрСведений.Уровни.СрезПоследних(&Период, Акция = &Акция) КАК УровниСрезПоследних
	|ГДЕ
	|	УровниСрезПоследних.КоличествоПокупки > 0
	|	И УровниСрезПоследних.АктивностьУровня = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	УровниСрезПоследних.БрокерскийСчет,
	|	УровниСрезПоследних.Акция,
	|	УровниСрезПоследних.Уровень,
	|	УровниСрезПоследних.КоличествоПокупки,
	|	УровниСрезПоследних.ЦенаПокупки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦенаПокупки УБЫВ";	
	Запрос.УстановитьПараметр("Акция",ТЗАкция.Акция); 
	Запрос.УстановитьПараметр("Период",ТЗАкция.Период);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	//РабочийУровньПокупки = ОбщиеПроцедурыИФункции.РезультатЗапросаВСтруктуру(РезультатЗапроса);
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	РабочийУровньПокупки = Новый ТаблицаЗначений;
	РабочийУровньПокупки.Колонки.Добавить("БрокерскийСчет");
	РабочийУровньПокупки.Колонки.Добавить("Акция");
	РабочийУровньПокупки.Колонки.Добавить("Уровень");
	РабочийУровньПокупки.Колонки.Добавить("КоличествоПокупки");
	РабочийУровньПокупки.Колонки.Добавить("ЦенаПокупки");
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    НоваяСтрока 					= РабочийУровньПокупки.Добавить();
		НоваяСтрока.БрокерскийСчет 		= ВыборкаДетальныеЗаписи.БрокерскийСчет;
		НоваяСтрока.Акция 				= ВыборкаДетальныеЗаписи.Акция;
		НоваяСтрока.Уровень 			= ВыборкаДетальныеЗаписи.Уровень;
		НоваяСтрока.КоличествоПокупки 	= ВыборкаДетальныеЗаписи.КоличествоПокупки;
		НоваяСтрока.ЦенаПокупки 		= ВыборкаДетальныеЗаписи.ЦенаПокупки;
	КонецЦикла;
	Возврат РабочийУровньПокупки; 
КонецФункции // ()  

Функция ПолучитьДокументаЗаявка (ОтборЗаявки)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.ТоговыйСчет = &ТоговыйСчет
	|	И Заявка.Инструмент = &Инструмент
	|	И Заявка.Уровень = &Уровень
	|	И Заявка.Статус В (&Статус)";
	Запрос.УстановитьПараметр("ТоговыйСчет",ОтборЗаявки.ТорговыйСчет);
	Запрос.УстановитьПараметр("Инструмент",ОтборЗаявки.Инструмент);
	Запрос.УстановитьПараметр("Уровень",ОтборЗаявки.Уровень);
	Запрос.УстановитьПараметр("Статус",ОтборЗаявки.Статус);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	ДокументЗаявка = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    ДокументЗаявка.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	Возврат ДокументЗаявка;
КонецФункции
